Revit 2024 API
AnalyticalDistributionNodePropertyData Class
 Represents the data and parameters of electrical analytical node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class AnalyticalDistributionNodePropertyData : IDisposable
Visual Basic
Public Class AnalyticalDistributionNodePropertyData _
	Implements IDisposable
Visual C++
public ref class AnalyticalDistributionNodePropertyData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
 Autodesk.Revit.DB.Electrical.AnalyticalBusData
 Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData
 Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData
 Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData
See Also
AnalyticalDistributionNodePropertyData Members
Autodesk.Revit.DB.Electrical Namespace